{
    "Coffee": "Coffee is a beverage brewed from roasted coffee beans. Darkly colored, bitter, and slightly acidic, coffee has a stimulating effect on humans, primarily due to its caffeine content. It has the highest sales in the world market for hot drinks.\nThe seeds of the Coffea plant's fruits are separated to produce unroasted green coffee beans. The beans are roasted and then ground into fine particles typically steeped in hot water before being filtered out, producing a cup of coffee. It is usually served hot, although chilled or iced coffee is common. Coffee can be prepared and presented in a variety of ways (e.g., espresso, French press, caffè latte, or already-brewed canned coffee). Sugar, sugar substitutes, milk, and cream are often added to mask the bitter taste or enhance the flavor.\nThough coffee is now a global commodity, it has a long history tied closely to food traditions around the Red Sea. The earliest credible evidence of coffee drinking as the modern beverage appears in modern-day Yemen in southern Arabia in the middle of the 15th century in Sufi shrines, where coffee seeds were first roasted and brewed in a manner similar to how it is now prepared for drinking. The coffee beans were procured by the Yemenis from the Ethiopian Highlands via coastal Somali intermediaries, and cultivated in Yemen. By the 16th century, the drink had reached the rest of the Middle East and North Africa, later spreading to Europe.\nThe two most commonly grown coffee bean types are C. arabica and C. robusta. Coffee plants are cultivated in over 70 countries, primarily in the equatorial regions of the Americas, Southeast Asia, the Indian subcontinent, and Africa. As of 2023, Brazil was the leading grower of coffee beans, producing 35% of the world's total. Green, unroasted coffee is traded as an agricultural commodity. Despite coffee sales reaching billions of dollars worldwide, farmers producing coffee beans disproportionately live in poverty. Critics of the coffee industry have also pointed to its negative impact on the environment and the clearing of land for coffee-growing and water use. The global coffee industry is massive and worth $495.50 billion as of 2023. Brazil, Vietnam, and Colombia are the top exporters of coffee beans as of 2023.\n\n",
    "Coffee preparation": "Coffee preparation is the process of turning coffee beans into liquid coffee. While the particular steps vary with the type of coffee and with the raw materials, the process includes four basic steps: raw coffee beans must be roasted, the roasted coffee beans must then be ground, and the ground coffee must then be mixed with hot or cold water (depending on the method of brewing) for a specific time (brewed), the liquid coffee extraction must be separated from the used grounds, and finally, if desired, the extracted coffee is combined with other elements of the desired beverage, such as sweeteners, dairy products, dairy alternatives, or toppings (such as shaved chocolate). \nCoffee is usually brewed hot, at close to the boiling point of water, immediately before drinking, yielding a hot beverage capable of scalding if splashed or spilled; if not consumed promptly, coffee is often sealed into a vacuum flask or insulated bottle to maintain its temperature. In most areas, coffee may be purchased unprocessed, or already roasted, or already roasted and ground. Whole roast coffee or ground coffee is often vacuum-packed to prevent oxidation and lengthen its shelf life. Especially in hot climates, some find cold or iced coffee more refreshing. This can be prepared well in advance as it maintains its character when stored cold better than as a hot beverage. \nEven with the same roast, the character of the extraction is highly dependent on distribution of particle sizes produced by the grinding process, temperature of the grounds after grinding, freshness of the roast and grind, brewing process and equipment, temperature of the water, character of the water itself, contact time with hot water (less sensitive with cold water), and the brew ratio employed. Preferred brew ratios of water to coffee often fall into the range of 15–18:1 by mass; even within this fairly small range, differences are easily perceived by an experienced coffee drinker. Processes can range from extremely manual (e.g. hand grinding with manual pour-over in steady increments) to totally automated by a single appliance with a reservoir of roast beans which it automatically measures and grinds, and water, which it automatically heats and doses. Another common style of automated coffee maker is fed a single-serving \"pod\" of pre-measured coffee grounds for each beverage. \nCharacteristics which may be emphasized or deemphasized by different preparation methods include: acidity (brightness), aroma (especially more delicate floral and citrus notes), mouthfeel (body), astringency, bitterness (both positive and negative), and the duration and intensity of flavour perception in the mouth (finish). The addition of sweeteners, dairy products (e.g. milk or cream), or dairy alternatives (e.g. almond milk) also changes the perceived character of the brewed coffee. Principally, dairy products mute delicate aromas and thicken mouthfeel (particularly when frothed), while sweeteners mask astringency and bitterness.",
    "List of coffee drinks": "Coffee drinks are made by brewing water with ground coffee beans. The brewing is either done slowly, by drip, filter, French press, moka pot or percolator, or done very quickly, under pressure, by an espresso machine. When put under the pressure of an espresso machine, the coffee is termed espresso, while slow-brewed coffees are generally termed brewed coffee. While all coffee drinks are based on either coffee or espresso, some drinks add milk or cream, some are made with steamed milk or non-dairy milks, or add water (like the americano). Upon milk additions, coffee's flavor can vary with different syrups or sweeteners, alcoholic liqueurs, and even combinations of coffee with espresso or tea. There are many variations to the basic coffee or espresso bases.\nWith the invention of the Gaggia machine, espresso and espresso with milk, such as cappuccino and latte, spread in popularity from Italy to the UK in the 1950s. It then came to America, and with the rise in popularity of the Italian coffee culture in the 1980s, it began to spread worldwide via coffeehouses and coffeehouse chains.\nThe caffeine content in coffee beans may be reduced via one of several decaffeination processes to produce decaffeinated coffee, also known as decaf, which may be served as regular, espresso or instant coffee.",
    "Cappuccino": "Cappuccino ( , Italian: [kapputˈtʃiːno]; pl.: cappuccini; from German Kapuziner) is an espresso-based coffee drink that is traditionally prepared with steamed milk including a layer of milk foam.\nVariations of the drink involve the use of cream instead of milk, using non-dairy milk substitutes and flavoring with cinnamon (in the United States) or cocoa powder (in Europe and Australasia). It is typically smaller in volume than that of caffè latte, and topped with a thick layer of foam rather than being made with microfoam.\nThe name comes from the Capuchin friars, referring to the color of their habits, and in this context referring to the color of the beverage when milk is added in small portion to dark, brewed coffee (today mostly espresso). The physical appearance of a modern cappuccino with espresso crema and steamed milk is a result of a long evolution of the drink. According to a popular but unverified legend, cappuccino was named after the Italian Capuchin friar Marco d'Aviano, who contributed to the victory of the Battle of Vienna.\nThe Viennese bestowed the name Kapuziner, possibly in the 18th century, on an early version that included whipped cream and spices of unknown origin. The Italian cappuccino was unknown outside Italy until the 1930s. It is sometimes said to have been born in the coffeehouses of Trieste and other Italian areas of the Austro-Hungarian Empire in the early 20th century, spreading throughout Italy after World War I and later worldwide. However, the existence in central Italy of a coffee drink mixed with milk with the name cappuccino is already documented in the 19th century.",
    "Latte": "Caffè latte (Italian: [kafˌfɛ lˈlatte]), often shortened to just latte () in English, is a coffee drink of Italian origin made with espresso and steamed milk, traditionally served in a glass. Variants include the chocolate-flavored mocha or replacing the coffee with another beverage base such as masala chai (spiced Indian tea), mate, matcha, turmeric or rooibos; alternatives to milk, such as soy milk, almond milk or oat milk, are also used.\nThe term comes from the Italian caffellatte or caffè latte, from caffè e latte, literally \"coffee and milk\"; in English orthography either or both words sometimes have an accent on the final e (a hyperforeignism in the case of *latté, or to indicate it is pronounced, not the more-common silent final e of English). In northern Europe and Scandinavia, the term café au lait has traditionally been used for the combination of espresso and milk. In France, cafè latte is from the original name of the beverage (caffè latte); a combination of espresso and steamed milk equivalent to a \"latte\" is in French called un crème (un grand crème using cream instead of milk) and in German Milchkaffee.\n\n",
    "Frappuccino": "Frappuccino is a line of blended iced coffee drinks sold by Starbucks. It may consist of coffee or crème base, blended with ice and ingredients such as flavored syrups and usually topped with whipped cream and or spices. It may also include blended Starbucks refreshers. Frappuccinos are also sold as bottled coffee beverages in grocery stores, convenience stores and from vending machines.",
    "Caffè mocha": "A caffè mocha (Arabic: موكا) ( or ), also called mocaccino (Italian: [mokatˈtʃiːno]), is a chocolate-flavoured warm beverage that is a variant of a caffè latte (Italian: [kafˈfɛ lˈlatte]), commonly served in a glass rather than a mug.  Other commonly used spellings are mochaccino and also mochachino. The name is derived from the city of Mokha, Taiz Governorate, Yemen, which was one of the centres of early coffee trade. Like latte, the name is commonly shortened to just mocha.",
    "Caffè americano": "Caffè americano (Italian: [kafˈfɛ ameriˈkaːno]; Spanish: café americano; lit. 'American coffee'), also known as americano or American, is a type of coffee drink prepared by diluting an espresso shot with hot water at a 1:3 to 1:4 ratio, resulting in a drink that retains the complex flavors of espresso, but in a lighter way. Its strength varies with the number of shots of espresso and the amount of water added. The name is also spelled with varying capitalization and use of diacritics: e.g., \"café americano\".\nIn Italy, caffè americano may mean either espresso with hot water or long-filtered coffee, but the latter is more precisely called caffè all'americana (lit. 'American-style coffee').",
    "Doppio": "Doppio espresso (Italian: [ˈdoppjo]) is a double shot which is extracted using double the amount of ground coffee in a larger-sized portafilter basket. This results in 60 ml (2.1 imp fl oz; 2.0 US fl oz) of drink, double the amount of a single shot espresso. Doppio is Italian multiplier, meaning 'double'. It is commonly called a standard double, due to its standard in judging the espresso quality in barista competitions, where four single espresso are made using two double portafilters. \nA single shot of espresso, by contrast, is called a solo (\"single\") and was developed because it was the maximum amount of ground coffee that could practically be extracted by lever espresso machines. At most cafés outside of Italy, a doppio is the standard shot. Because solos require a smaller portafilter basket, solo shots are often produced by making (\"pulling\") a doppio in a two-spout portafilter and only serving one of the streams; the other stream may be discarded or used in another drink.",
    "Caffè macchiato": "Caffè macchiato (Italian: [kafˈfɛ makˈkjaːto] ), sometimes called espresso macchiato, is an espresso coffee drink with a small amount of milk, usually foamed. In Italian, macchiato means 'stained' or 'spotted', so the literal translation of caffè macchiato is 'stained coffee' or 'marked coffee'.",
    "Cortado": "A cortado is a Spanish beverage consisting of espresso mixed with a roughly equal amount of warm milk to reduce the acidity, although the exact ratios have considerable regional variation. The milk in a cortado is steamed, but not frothy and \"texturized\" as in many Italian coffee drinks. The cortado is commonly served all over Spain.  The word cortado is the past participle of the Spanish verb cortar (to cut), in the sense of \"dilute\", and can refer variously to either coffee or espresso drinks throughout Spanish and Portuguese speaking countries.",
    "Ristretto": "Ristretto (Italian: [risˈtretto]) is a \"short shot\" (20 ml (0.7 imp fl oz; 0.7 US fl oz) from a double basket) of a more highly concentrated espresso coffee. It is made with the same amount of ground coffee, but extracted with a finer grind (also in from 20 to 30 seconds) using half as much water. A normal short shot might look like a ristretto, but in reality, would only be a weaker, more diluted, shot. The opposite of a ristretto (Italian for 'shortened', 'narrow') is a lungo ('long'), which has double the amount of water. The French call a ristretto a café serré.\nRegardless of whether one uses a hand pressed machine or an automatic, a regular double shot is generally considered to be around 14–18 g (0.49–0.63 oz) of ground coffee extracted into about 40 ml (2 fl oz; two shot glasses). Thus, a \"double ristretto\" consumes the same amount of coffee beans but fills only a single shot glass.\nCoffee contains over a thousand aromatic compounds. A ristretto's chemical composition and taste differ from those of a full-length extraction for three reasons:\n\nMore concentrated: the first part of any extraction is the most concentrated, its color typically lying between dark chocolate and umber, whereas the tail end of shots are much lighter, varying from the color of dark pumpkin pie to varying shades of tan (see photo, above right). This is an important factor when drinking straight espresso shots.\nDifferent balance: different chemical compounds in ground coffee dissolve into hot water at different rates. A ristretto contains a greater relative proportion of faster extracting compounds, proportionally fewer of the compounds characteristic of over-extraction, and thus, a different balance.\nFewer total extracts: relative proportions aside, fewer total coffee compounds—caffeine being just one—are extracted into ristrettos versus full length shots. This is an important factor when diluting shots into water or milk.\nStraight ristrettos—shots that are traditionally drunk from a demitasse and not diluted into a larger cup containing milk or water—could be described as bolder, fuller, with more body and less bitterness. These characteristics are usually attributed to espresso in general but are more pronounced in a ristretto. Diluted into a cup of water (e.g. americano or long black) or milk (e.g. latte or cappuccino), ristrettos are less bitter and exhibit a more intense espresso character.",
    "Lungo": "Lungo (lit. 'long') is a coffee beverage made by using an espresso machine to make an Italian-style coffee—short black (a single espresso shot) with more water (generally twice as much), resulting in a larger coffee, a lungo.\nA normal serving of espresso takes from 18 to 30 seconds to pull, and fills 25 to 30 millilitres, while a lungo may take up to a minute to pull, and might fill 50 to 70 millilitres. Extraction time of the dose is determined by the variety of coffee beans (usually a blend of Arabica and Robusta), their grind and the pressure of the machine. It is usually brewed using an espresso machine, but with two times the amount of water to the same weight of coffee, to make a much longer drink.\nIn French, it is called café allongé and is popular in the French-Canadian province of Quebec.",
    "Galão": "Galão (Portuguese pronunciation: [ɡɐˈlɐ̃w]) is a hot drink from Portugal made by adding foamed milk to espresso coffee. Similar to caffè latte or café au lait, it consists of about one quarter coffee and three quarters foamed milk. It is served in a tall glass, as opposed to the smaller garoto that is served in a demitasse. When the proportion is 1:1 it is called meia de leite (half of milk) and it comes in a cup.",
    "Affogato": "An affogato (), known in full in Italian as (gelato) affogato al caffè ('(ice cream) drowned in coffee'), is an Italian coffee-based dessert. It usually takes the form of a scoop of plain milk-flavored (fior di latte) or vanilla gelato or ice cream topped or \"drowned\" with a shot of hot espresso. Some variations add a shot of amaretto, bicerin, Kahlúa, or other liqueur.",
    "Espresso con panna": "Espresso con panna (lit. 'espresso with cream') is a single or double shot of espresso topped with whipped cream. In France and in the United Kingdom it is known as café viennois.\nIn northern continental Europe, the term Wiener Melange refers to a different drink, made with foamed milk and having no whipped cream on top. In Vienna, an espresso con panna is properly called a Franziskaner, but ordering a Wiener Melange may sometimes yield the arrival of espresso con panna even in Vienna.\nIn France, café viennois refers to both an espresso con panna and a Wiener Melange. In Australia, a similar drink may be called Café Vienna although espresso con panna will traditionally be in an espresso sized cup, whereas Café Vienna will be served in the same size as a latte.\nHistorically served in a demitasse cup, it is perhaps a more old fashioned drink than a latte or cappuccino, though still very popular, whichever name it receives, at coffeehouses in Budapest and Vienna.",
    "Cold brew coffee": "Cold brew coffee, also called cold water extraction or cold pressing, is the process of steeping coffee grounds in water at cool temperatures for an extended period. Coarse-ground beans are soaked in water for about 12 to 24 hours.\n\nThe water is normally kept at room temperature, but chilled water can also be used. After the grounds have been steeped, they are filtered out of the water using a paper coffee filter, a fine metal sieve (e.g. in a French press), or felt. The result is a coffee concentrate that is diluted with water or milk, and is even sometimes served hot, but often served chilled, over ice, or blended with ice and other ingredients such as chocolate.",
    "Milk coffee": "Milk coffee is a category of coffee-based drinks made with milk.\nJohan Nieuhof, the Dutch ambassador to China, is credited as the first person to drink coffee with milk when he experimented with it around 1660.",
    "Drip coffee": "Drip coffee is made by pouring hot water onto ground coffee beans, allowing it to brew while seeping through. There are several methods for doing this, including using a filter. Terms used for the resulting coffee often reflect the method used, such as drip-brewed coffee, or, somewhat inaccurately, filtered coffee in general. Manually brewed drip coffee is typically referred to as pour-over coffee. Water seeps through the ground coffee, absorbing its constituent chemical compounds, and then passes through a filter. The used coffee grounds are retained in the filter, while the brewed coffee is collected in a vessel such as a carafe or pot.",
    "Mazagran (drink)": "Mazagran (also called café mazagran, formerly spelled masagran) is a cold, sweetened coffee drink that originated in Algeria. Portuguese versions may use espresso, lemon, mint and rum, and Austrian versions are served with an ice cube and include rum. Sometimes a fast version is achieved by pouring a previously sweetened espresso in a cup with ice cubes and a slice of lemon. Mazagran has been described as \"the original iced coffee\".",
    "moka pot": "The moka pot is a stove-top or electric coffee maker that brews coffee by passing hot water driven by vapor pressure through ground coffee. Named after the Yemeni city of Mocha, it was invented by Italian engineer Luigi Di Ponti in 1933  who sold the patent to Alfonso Bialetti, an aluminum vendor. It quickly became one of the staples of Italian culture. Bialetti Industries continues to produce the original model under the trade name \"Moka Express\".\nSpreading from Italy, the moka pot is today most commonly used in Europe and in Latin America. It has become an iconic design, displayed in modern industrial art and design museums including the Wolfsonian-FIU, the Cooper–Hewitt, National Design Museum, the Design Museum, the London Science Museum, The Smithsonian and the Museum of Modern Art. \nMoka pots come in different sizes, making from one to eighteen 50 ml (2 imp fl oz; 2 US fl oz) servings. The original design and many current models are made from aluminium with Bakelite handles.\nAfter the Second World War, the Italian moka pot spread all over the south of Europe and became the standard way of domestically making coffee. Its popularity led to non-Italian south European manufacturers making copies or new designs inspired by the original Italian design.\nIn Australia, the moka pot was traditionally used by Italian migrants who arrived mostly after the Second World War. By 2000, the moka had become popular in the homes of many Australians. Today it is quite popular at breakfast time; often Australians will add the brew to a mug and top up with either water off the boil or warmed milk.\nMoka pots are typically made of aluminium, though they are sometimes made out of stainless steel or other alloys. Some designs feature an upper half made of heat-resistant glass.",
    "French press": "A French press, also known as a cafetière, cafetière à piston, caffettiera a stantuffo, press pot, coffee press, or coffee plunger, is a coffee brewing device, although it can also be used for other tasks. The earliest known  device was patented in 1852 in France by Jacques-Victor Delforge and Henri-Otto Mayer.\n\n",
    "percolator": "",
    "Coffee bean": "A coffee bean is a seed from the Coffea plant and the source for coffee. It is the pit inside the red or purple fruit. This fruit is often referred to as a coffee cherry, and like the cherry, it is a fruit with a pit. Even though the coffee beans are not technically beans, they are referred to as such because of their resemblance to true beans. The fruits most commonly contain two stones with their flat sides together. A small percentage of cherries contain a single seed, instead of the usual two, called a \"peaberry\". The peaberry occurs only between 10% and 15% of the time, and it is a fairly common (yet scientifically unproven) belief that they have more flavour than normal coffee beans. Like Brazil nuts (a seed) and white rice, coffee beans consist mostly of endosperm.\nThe two most economically important varieties of coffee plants are the Arabica and the Robusta; approximately 60% of the coffee produced worldwide is Arabica and ~40% is Robusta. Arabica beans consist of 0.8–1.4% caffeine and Robusta beans consist of 1.7–4.0% caffeine. As coffee is one of the world's most widely consumed beverages, coffee beans are a major cash crop and an important export product, accounting for over 50% of some developing nations' foreign exchange earnings. This has made coffee very important in culture and food around the world. In 2017, 70% of total coffee production was exported, worth US$19.9 billion. The global coffee industry is massive and valued at $495.50 billion as of 2023, the biggest producer of coffee and coffee beans is Brazil. Other main exporters of coffee beans are Colombia, Vietnam and Ethiopia.",
    "Espresso machine": "An espresso machine brews coffee by forcing pressurized water near boiling point through a \"puck\" of ground coffee and a filter in order to produce a thick, concentrated coffee called espresso. Multiple machine designs have been created to produce espresso. Several machines share some common elements, such as a grouphead and a portafilter. An espresso machine may also have a steam wand which is used to steam and froth liquids (such as milk) for coffee drinks such as cappuccino and caffè latte.\nEspresso machines may be steam-driven, piston-driven, pump-driven, or air-pump-driven. Machines may also be manual or automatic.\n\n",
    "Coffee filter": "A coffee filter is a filter used for various coffee brewing methods including but not limited to drip coffee filtering. Filters made of paper (disposable), cloth (reusable), or plastic, metal or porcelain (permanent) are used. Paper and cloth filters require the use of some kind of filter holder, whereas filters made out of other materials may present an integral part of the holder or not, depending on construction. The filter allows the liquid coffee to flow through, but traps the coffee grounds.",
    "Espresso": "Espresso ( , Italian: [eˈsprɛsso]) is a coffee-brewing method in which a small amount of nearly boiling water is forced under pressure through finely ground coffee beans.\nEspresso can be made with a wide variety of coffee beans and roast degrees, and numerous espresso-based drinks exist, often blending in milk. It is one of the world's most popular coffee-brewing methods.\n\n",
    "Gaggia": "Gaggia is an Italian manufacturer of coffee machines, especially espresso machine, in addition to small kitchen appliances. The company is owned by Saeco.",
    "Coffeehouse": "A coffeehouse, coffee shop, or café is an establishment that primarily serves various types of coffee, espresso, latte, and cappuccino. Some coffeehouses may serve cold drinks, such as iced coffee and iced tea, as well as other non-caffeinated beverages. A coffeehouse may also serve food, such as light snacks, sandwiches, muffins, fruit, or pastries. In continental Europe, some cafés also serve alcoholic beverages. Coffeehouses range from owner-operated small businesses to large multinational corporations. Some coffeehouse chains operate on a franchise business model, with numerous branches across various countries around the world.\nWhile café may refer to a coffeehouse, the term \"café\" can also refer to a diner, British café (also colloquially called a \"caff\"), \"greasy spoon\" (a small and inexpensive restaurant), transport café, teahouse or tea room, or other casual eating and drinking place. A coffeehouse may share some of the same characteristics of a bar or restaurant, but it is different from a cafeteria. Many coffeehouses in West Asia offer shisha (actually called nargile in Levantine Arabic, Greek, and Turkish), flavored tobacco smoked through a hookah. An espresso bar is a type of coffeehouse that specializes in serving espresso and espresso-based drinks.\nFrom a cultural standpoint coffeehouses largely serve as centers of social interaction: a coffeehouse provides patrons with a place to congregate, talk, read, write, entertain one another, or pass the time, whether individually or in small groups. A coffeehouse can serve as an informal club for its regular members. As early as the 1950s Beatnik era and the 1960s folk music scene, coffeehouses have hosted singer-songwriter performances, typically in the evening.",
    "List of coffeehouse chains": "This list of notable coffeehouse chains catalogues the spread and markets share of coffeehouses world-wide. This list excludes the many companies which operate coffeeshops within retail establishments, notably bookstores and department stores, or restaurants or convenience stores which also serve coffee. These chains frequently engage in coffee wars to gain brand and consumer market share. Starbucks, Dunkin', and Tim Hortons are the three largest coffee companies in the world, respectively. The largest coffee houses typically have substantial supply-chain relations with the world's major coffee-producing countries. They collectively wield prominent influence in global coffee economics by setting commodity prices, maintaining value chains, and supporting developing economics.",
    "Caffeine": "Caffeine is a central nervous system (CNS) stimulant of the methylxanthine class. It is mainly used as a eugeroic (wakefulness promoter) or as a mild cognitive enhancer to increase alertness and attentional performance. Caffeine acts by blocking binding of adenosine to the adenosine A1 receptor, which enhances release of the neurotransmitter acetylcholine. Caffeine has a three-dimensional structure similar to that of adenosine, which allows it to bind and block its receptors. Caffeine also increases cyclic AMP levels through nonselective inhibition of phosphodiesterase.\nCaffeine is a bitter, white crystalline purine, a methylxanthine alkaloid, and is chemically related to the adenine and guanine bases of deoxyribonucleic acid (DNA) and ribonucleic acid (RNA). It is found in the seeds, fruits, nuts, or leaves of a number of plants native to Africa, East Asia and South America, and helps to protect them against herbivores and from competition by preventing the germination of nearby seeds, as well as encouraging consumption by select animals such as honey bees. The best-known source of caffeine is the coffee bean, the seed of the Coffea plant. People may drink beverages containing caffeine to relieve or prevent drowsiness and to improve cognitive performance. To make these drinks, caffeine is extracted by steeping the plant product in water, a process called infusion. Caffeine-containing drinks, such as coffee, tea, and cola, are consumed globally in high volumes. In 2020, almost 10 million tonnes of coffee beans were consumed globally. Caffeine is the world's most widely consumed psychoactive drug. Unlike most other psychoactive substances, caffeine remains largely unregulated and legal in nearly all parts of the world. Caffeine is also an outlier as its use is seen as socially acceptable in most cultures and even encouraged in others.\nCaffeine has both positive and negative health effects. It can treat and prevent the premature infant breathing disorders bronchopulmonary dysplasia of prematurity and apnea of prematurity. Caffeine citrate is on the WHO Model List of Essential Medicines. It may confer a modest protective effect against some diseases, including Parkinson's disease. Some people experience sleep disruption or anxiety if they consume caffeine, but others show little disturbance. Evidence of a risk during pregnancy is equivocal; some authorities recommend that pregnant women limit caffeine to the equivalent of two cups of coffee per day or less. Caffeine can produce a mild form of drug dependence – associated with withdrawal symptoms such as sleepiness, headache, and irritability – when an individual stops using caffeine after repeated daily intake. Tolerance to the autonomic effects of increased blood pressure and heart rate, and increased urine output, develops with chronic use (i.e., these symptoms become less pronounced or do not occur following consistent use).\nCaffeine is classified by the US Food and Drug Administration as generally recognized as safe. Toxic doses, over 10 grams per day for an adult, are much higher than the typical dose of under 500 milligrams per day. The European Food Safety Authority reported that up to 400 mg of caffeine per day (around 5.7 mg/kg of body mass per day) does not raise safety concerns for non-pregnant adults, while intakes up to 200 mg per day for pregnant and lactating women do not raise safety concerns for the fetus or the breast-fed infants. A cup of coffee contains 80–175 mg of caffeine, depending on what \"bean\" (seed) is used, how it is roasted, and how it is prepared (e.g., drip, percolation, or espresso). Thus it requires roughly 50–100 ordinary cups of coffee to reach the toxic dose. However, pure powdered caffeine, which is available as a dietary supplement, can be lethal in tablespoon-sized amounts.",
    "Decaffeination": "Decaffeination is the removal (\"de-\") of caffeine from coffee beans, cocoa, tea leaves, and other caffeine-containing materials. Decaffeinated products are commonly termed by the abbreviation decaf. Decaffeinated drinks contain typically 1–2% of the original caffeine content, but sometimes as much as 20%.",
    "Coffee roasting": "Roasting coffee transforms the chemical and physical properties of green coffee beans into roasted coffee products. The roasting process is what produces the characteristic flavor of coffee by causing the green coffee beans to change in taste. Unroasted beans contain similar if not higher levels of acids, protein, sugars, and caffeine as those that have been roasted, but lack the taste of roasted coffee beans due to the Maillard and other chemical reactions that occur during roasting.\nCoffee tends to be roasted close to where it will be consumed, as green coffee is more stable than roasted beans. The vast majority of coffee is roasted commercially on a large scale, but small-scale commercial roasting has grown significantly with the trend toward \"single-origin\" coffees served at specialty shops. Some coffee drinkers even roast coffee at home as a hobby in order to both experiment with the flavor profile of the beans and ensure the freshest possible roasted coffee.\nThe first recorded implements for roasting coffee beans were thin pans made from metal or porcelain, used in the 15th century in the Ottoman Empire and Greater Persia. In the 19th century, various patents were awarded in the U.S. and Europe for commercial roasters, to allow for large batches of coffee. In the 1950s just as instant coffee was becoming a popular coffee drink, speciality coffee-houses began opening to cater to the connoisseur, offering a more traditionally brewed beverage. In the 1970s, more speciality coffee houses were founded, ones that offered a variety of roasts and beans from around the world. In the 1980s and 1990s, the gourmet coffee industry experienced great growth. This trend continued into the 21st century.\n\n",
    "Carafe": "A carafe () is a glass container with a flared lip used for serving liquids, especially wine and coffee.  Unlike the related decanter, carafes generally do not include stoppers. Coffee pots included in coffee makers are also referred to as carafes in American English.",
    "Vacuum coffee maker": "A vacuum coffee maker brews coffee using two chambers where vapor pressure and gravity produce coffee. This type of coffee maker is also known as vac pot, siphon or syphon coffee maker, and was invented by Loeff of Berlin in the 1830s. These devices have since been used for more than a century in many parts of the world. Design and composition of the vacuum coffee maker varies.  The chamber material is borosilicate glass, metal, or plastic, and the filter can be either a glass rod or a screen made of metal, cloth, paper, or nylon. The Napier Vacuum Machine by James Robert Napier, presented in 1840, was an early example of this technique. While vacuum coffee makers generally were excessively complex for everyday use, they were prized for producing a clear brew, and were quite popular until the middle of the twentieth century. Vacuum coffee makers remain popular in some parts of Asia, including Japan and Taiwan. The Bauhaus interpretation of this device can be seen in Gerhard Marcks' Sintrax coffee maker of 1925.\n\n",
    "Microfoam": "Microfoam is finely textured milk used for making espresso-based coffee drinks, particularly those with latte art. It is typically made with the steam wand of an espresso machine, which pumps steam into a pitcher of milk.\nThe opposite of microfoam is macrofoam (also called dry foam, in contrast to the wet foam of microfoam), which has visibly large bubbles, a style of milk traditionally used for cappuccinos.",
    "Cuban espresso": "Café Cubano (also known as  Cuban espresso, Colada, Cuban coffee, cafecito, Cuban pull, and Cuban shot) is a type of espresso that originated in Cuba. Specifically, it refers to an espresso shot which is sweetened (traditionally with natural brown sugar which has been whipped with the first and strongest drops of espresso). However, the name is sometimes used to refer to coffee based drinks that include Cuban espresso as the main ingredient, such as café con leche.\nDrinking café cubano remains a prominent social and cultural activity in Cuba and in Cuban-American communities, particularly in Miami, Tampa and the Florida Keys.",
    "Caffè crema": "Caffè crema (lit. 'cream coffee') refers to two different coffee drinks:\n\nAn old name for espresso (1940s and 1950s).\nA long espresso drink served primarily in Germany, Switzerland and Austria and northern Italy (1980s onwards), along the Italian/Swiss and Italian/Austrian border. In Germany it is generally known as a \"Café Crème\" or just \"Kaffee\" and is generally the default type of black coffee served, unless there is a filter machine.\nAs a colorful term it generally means \"espresso\", while in technical discussions, referring to the long drink, it may more narrowly be referred to as Swiss caffè crema. In addition, there is also Italian iced crema caffè.\nVariant terms include crema caffè and the hyperforeignism café crema – café crème is the direct French translation, but in France it contains dairy. Caffè and crema are Italian; thus café crema mixes French and Italian.\n\n",
    "Liqueur coffee": "A liqueur coffee is a caffeinated alcoholic drink that consists of a shot of liqueur, mixed with coffee. It is typically served in a liqueur glass, often accompanied with cream and sugar. Coffee liqueur beverages are served in different fashions and can be found throughout many countries. One of the most popular liqueur coffee beverage is commonly known as Irish coffee. Liqueur coffee beverages are largely classified as cocktails as well as digestifs which are aimed at aiding the digestive process typically after a meal.",
    "Asiático": "Asiático is an alcoholic drink made out of coffee, it is typical from the Spanish city of Cartagena and very representative of the cuisine of the Campo de Cartagena.",
    "B-52 (cocktail)": "The B-52 (also B52 or Bifi or Bifty) cocktail is a layered shot composed of coffee liqueur (Kahlúa), Irish cream (Baileys Irish Cream), and Grand Marnier (in later versions replaced with triple sec or Cointreau). When prepared properly, the ingredients separate into three distinctly visible layers (due to their relative densities).",
    "Black Russian": "The Black Russian is a cocktail of vodka and coffee liqueur. It contains 50 ml vodka and 20 ml coffee liqueur, per IBA specified ingredients.\nThe drink is made by pouring the vodka and coffee liqueur over ice cubes or cracked ice in an old-fashioned glass and stirring. The Black Russian is often garnished with a lemon slice and a Luxardo maraschino cherry on a stick.",
    "Café com cheirinho": "Café com cheirinho (lit. 'coffee with a scent') or bica com cheirinho is a Portuguese coffee with added alcohol (wine, aguardente, bagaço or medronho). Occasionally, the spirit can be served on the side. This combination is especially favored during colder seasons, and it is best enjoyed as a digestif.\nIt is also called a café com música (lit. 'coffee with music') in Madeira and Azores.",
    "Caffè corretto": "Caffè corretto (Italian: [kafˈfɛ kkorˈrɛtto]) is an Italian caffeinated alcoholic drink, consisting of a shot of espresso with a small amount of liquor, usually grappa, and sometimes sambuca or brandy. It is also known (outside Italy) as an espresso corretto. It is ordered as un caffè corretto alla grappa, ... alla sambuca, ... al cognac, or corretto di Spadino, depending on the desired liquor.\nA caffè corretto is often prepared by simply adding a few drops of the desired spirit into an espresso shot; however in some cases the alcohol is served in a shot alongside the coffee, allowing the customer to pour the quantity they desire.\nThe Italian word corretto corresponds to the English word 'correct' in the sense of 'corrected'. The term is now an Italian phraseme.\nCaffè corretto can also be found widely in Eritrea, a legacy of the Italian colonization of Eritrea. In Asmarino, locally produced areki and cognac are used.\nIn Spain, a similar drink is known as carajillo; in Portugal café com cheirinho (coffee with scent); in France café-calva (coffee and Calvados); in Sweden, Norway, and Denmark kaffekask, karsk, or kaffegök; and in Mexico cafe con piquete.",
    "Carajillo": "A carajillo (Spanish: [kaɾa'xiʝo, -ʎo]) is a coffee drink to which a liquor is added. Similar to Irish coffee, it is typical of Spain and several Latin American countries, such as Colombia and Venezuela, where it is usually made with brandy; Cuba, where it is usually made with rum; and in Mexico, where mezcal or a coffee liqueur such as Kahlúa or Tía María may be used. Spices such as cinnamon and fruit such as lemon peel are commonly added to more elaborate versions in Spain. Carajillo is usually served in a small glass.",
    "Cremat": "Cremat, or rom cremat (Catalan pronunciation: [ˈrom kɾəˈmat], Catalan for 'burnt rum') is an alcoholic cocktail of Catalan origin. Although many different recipes exist, the common elements to most of them are rum, sugar, spices (particularly cinnamon), lemon peel, and some form of coffee (usually roasted beans, but soluble instant coffee or brewed coffee are also used).",
    "Espresso martini": "The espresso martini, also known as a vodka espresso, is a cold caffeinated alcoholic drink made with espresso, coffee liqueur, and vodka. It is not a true martini as it contains neither gin nor vermouth, but is one of many drinks that incorporate the term martini into their names.",
    "Karsk": "Karsk (also called kask) is a Swedish and Norwegian cocktail (from the Trøndelag region) containing coffee together with moonshine and sometimes a spoon of sugar (enthusiasts often consider moonshine exclusively to be appropriate as an added component, as it has no inherent taste like other alcoholic beverages). Broader, it can also be found in other parts of Scandinavia.",
    "Moretta (coffee)": "Moretta (complete name Moretta fanese) is a typical hot coffee from Fano, in the Province of Pesaro and Urbino, Italy, and is popular in the fishing areas near the coast. It is strong and sweet, and usually drunk after meals as a digestive, or used as a hot drink on cold afternoons.",
    "Piscoffee": "The Piscoffee is a preparation based in coffee and pisco which has two variations, a cold and a hot one.\nIced piscoffee is very similar to piscola, three ice cubes, Pisco and iced coffee or iced tea if preferred. Hot piscoffee is very similar to Irish coffee is prepared by adding cream and pisco to a cup of coffee.\nThis preparation appears in recent times among law students, apparently at the Pontifical Catholic University of Chile. It has become popular among many students of that discipline at all universities in Chile, due to the widespread practice of those enrolled to study at night to stay awake while studying.",
    "Rüdesheimer Kaffee": "Rüdesheimer Kaffee is an alcoholic coffee drink from Rüdesheim am Rhein in Germany invented in 1957 by the German television chef, Hans Karl  Adam. It is a popular drink in coffee houses.\nAsbach Uralt brandy and sugar cubes are added to a cup. In Rüdesheim, a cup that is specially designed for this beverage is used. The brandy is flambéed and stirred for a minute until the sugar dissolves. Strong coffee is added, followed by a topping of thickly whipped cream sweetened with vanilla sugar. Chocolate flakes are scattered onto the cream as a garnish.",
    "White Russian (cocktail)": "A white Russian is a cocktail made with vodka, coffee liqueur (e.g., Kahlúa or Tia Maria) and cream served with ice in an old fashioned glass.",
    "Barraquito": "Barraquito (Spanish pronunciation: [bara'kito]) is a coffee liqueur commonly available on Tenerife (one of the Canary Islands), also known as zaperoco.",
    "Gunfire (drink)": "Gunfire (or gun-fire) is a British caffeinated alcoholic drink, a cocktail made of black tea and rum. It has its origins in the British Army and is also used as a name for early morning tea in the army.",
    "Café de olla": "Café de olla (lit. 'pot coffee') is a traditional Mexican coffee beverage.  To prepare café de olla, it is essential to use a traditional earthen clay pot, as this gives a special flavor to the coffee.  This type of coffee is principally consumed in cold climates and in rural areas.\nIn Mexico, a basic café de olla is made with ground coffee, cinnamon, and piloncillo. Optional ingredients include orange peel, anise, and cloves.",
    "Marocchino": "Marocchino is a coffee drink created in Alessandria, Italy.",
    "Frappé coffee": "A frappé coffee, cold coffee, Greek frappé, or just frappé (Greek: φραπέ, frapé [fraˈpe]) is a Greek iced coffee drink generally made from spray-dried instant coffee, water, sugar, and milk. The word is often written frappe (without an accent). The frappé was invented in 1957 in Thessaloniki through experimentation by Dimitris Vakondios, a Nescafe representative. Frappés are among the most popular forms of coffee in Greece and Cyprus and have become a hallmark of postwar outdoor Greek coffee culture.\nThis Greek invention should not be confused with the Frappuccino, a trademarked name now owned by Starbucks. The Frappuccino was invented in Boston, Massachusetts in 1992 by Andrew Frank, an employee of the Coffee Connection. The name derives from \"frappe\" (pronounced  and spelled without the accent)—the New England name for a thick milkshake with ice cream, derived from the French word lait frappé (beaten milk)—and cappuccino.\nBecause \"frappuccino\" is trade-marked, some Starbucks's competitors drop the \"uccino\" and just call their competing drink a \"frappe\", sometimes adding an accent mark to make it \"frappé\".",
    "Shakerato": "A shakerato is an Italian drink prepared using espresso and ice cubes. It is popular and easily obtainable in Italy.",
    "Instant coffee": "Instant coffee is a beverage derived from brewed coffee beans that enables people to quickly prepare hot coffee by adding hot water or milk to coffee solids in powdered or crystallized form and stirring. The product was first invented in Invercargill, the largest city in Southland, New Zealand, in 1890. Instant coffee solids (also called soluble coffee, coffee crystals, coffee powder, or powdered coffee) refers to the dehydrated and packaged solids available at retail used to make instant coffee. Instant coffee solids are commercially prepared by either freeze-drying or spray drying, after which it can be rehydrated. Instant coffee in a concentrated liquid form, as a beverage, is also manufactured. \nAdvantages of instant coffee include speed of preparation (instant coffee dissolves quickly in hot water), lower shipping weight and volume than beans or ground coffee (to prepare the same amount of beverage), and long shelf life—though instant coffee can spoil if not kept dry.  Instant coffee also reduces cleanup since there are no coffee grounds, and at least one study has found that it has a lower environmental footprint than drip filter coffee and capsule espresso coffee, on a prepared beverage basis, disregarding quality and appeal of the beverage produced.",
    "Beaten coffee": "Beaten coffee or phenti hui coffee or phitti hui coffee is an Indian home-style coffee beverage made mostly with instant coffee and sugar. It is known as 'beaten' as the process involves beating the coffee and sugar together with a spoon to aerate into a light brown fluffy paste-like substance. It is generally served with warm milk, which creates a thick froth on the top. Another popular way of serving it is by pouring the paste on top of a cup of warm or cold milk.\nBeaten coffee can be prepared without any special machines or coffee mixes. Coffee is beaten with milk, hot water, and sugar, incorporating air into the paste until frothy. As milk is added, the coffee is further dissolved and air is released creating a creamy texture. This method of hand-beating is what gives the coffee the name \"Beaten Coffee\".",
    "Dalgona coffee": "Dalgona coffee, also known as hand beaten coffee, is a beverage originating from Macau made by whipping equal parts instant coffee powder, sugar, and hot water until it becomes creamy and then adding it to cold or hot milk. Occasionally, it is topped with coffee powder, cocoa, crumbled biscuits, or honey. It was popularized on social media during the COVID-19 pandemic, when people refraining from going out started making videos of whipping the coffee at home, by hand without using electrical mixers. After the drink spread to South Korea, it was renamed \"dalgona coffee\" which is derived from dalgona, a Korean sugar candy, due to the resemblance in taste and appearance, though most dalgona coffee does not actually contain dalgona.",
    "Café Touba": "Café Touba is a coffee beverage that is a popular traditional drink from Senegal that is (more recently) also consumed in Guinea-Bissau, and is named for the city of Touba, Senegal.\nCafé Touba is a coffee drink that is flavored with grains of Selim or Guinea pepper (the dried fruit of the shrub Xylopia aethiopica) (locally known as djar, in the Wolof language) and sometimes cloves. The addition of djar, that is cultivated in  Touba, is the important factor differentiating café Touba from plain coffee. The spices are mixed and roasted with coffee beans, then ground into a powder. The drink is prepared using a filter, in a manner similar to that used to prepare drip coffee.",
    "Canned coffee": "Canned coffee (缶コーヒー, kan kōhī) is a pre-brewed version of the beverage, sold ready to drink. It is particularly popular in Japan, South Korea, and elsewhere across Asia, and produced in a number of styles and by a large number of companies. Canned coffee is available in supermarkets and convenience stores, with large numbers of cans also being sold in vending machines that offer heated cans in the autumn and winter, and cold cans in the warm months.",
    "Coffee milk": "Coffee milk is a drink made by mixing coffee syrup or extract with milk, in a manner similar to chocolate milk. Since 1993, it has been the official state drink of the U.S. state of Rhode Island.",
    "Egg coffee": "An egg coffee (Vietnamese: Cà phê trứng) is a Vietnamese drink traditionally prepared with egg yolks, sugar, condensed milk and robusta coffee. The drink is made by beating egg yolks with sugar and condensed milk, then extracting the coffee into the cup, followed by a similar amount of egg cream, or egg yolks which are heated and beaten, or whisked.\nThe drink is served in cafes throughout Vietnam, originating in Hanoi. The Giang Café (Vietnamese: Cà Phê Giảng) in Hanoi is known for serving the drink, which it makes with egg yolk, coffee powder, condensed milk, and, optionally, cheese. The cup is sometimes served inside a bowl of hot water or set upon a small candle to retain its temperature. The son of the café's founder Nguyen Giang claims that his father developed the recipe for the drink when milk was scarce in Vietnam in the late 1940s, replacing milk with egg yolk.",
    "Indian filter coffee": "Indian filter coffee is a coffee drink made by mixing hot milk and sugar with the infusion obtained by percolation brewing of finely ground coffee powder with chicory in a traditional Indian filter. It has been described as \"hot, strong, sweet and topped with bubbly froth\" and is known as filter kaapi in India."
}